app/views/carts/index.html.erb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 ORDER BY "cart_items"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE (id = current_item.product_id) ORDER BY "products"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
<%  # item.product_id
    current_item =  CartItem.where(id: item).first
    product = Product.where(id: current_item.product_id).first