app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 ORDER BY "carts"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def index

    user_id = current_user.id
    @current_cart_items= Cart.where(user_id: user_id).first.items