app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts"
---
  def index
<<<<<<< HEAD
    @carts=Cart.all