app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "fruite"], ["created_at", "2019-04-21 11:52:44.044609"], ["updated_at", "2019-04-21 11:52:44.044609"]]
---
  def create
      category = Category.create(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "fruite1"], ["updated_at", "2019-04-21 11:51:29.348592"], ["id", 1]]
---
    def update
        category =Category.find(params[:id])
        category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]
---
    def destroy
        category =Category.find(params[:id])
        category.destroy