app/controllers/orders_controller.rb

  def show
    # get the clicked order
    @order=Order.find(params[:id])
    # get all order details
    orderDetails = OrderDetail.all
    @orderDetailsList =[]
    # push the ones with orderID equal to the one we want
    orderDetails.each do |orderD|
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details"