app/controllers/pages_controller.rb

SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products"
---
  def home
    @categories = Category.all
    @products = Product.all

SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products"
SELECT "orders".* FROM "orders"
SELECT "users".* FROM "users"
---
  def admin
    @categories = Category.all
    @products = Product.all
    @orders = Order.all
    @users = User.all