app/controllers/products_controller.rb

  def index
    @products=Product.all
    @categories = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"

  def show
    #get product paam
    @product=Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def addCart
    p "added"
    # get user id and roduct id
    # if current_user
    user_id = current_user.id
    # p params[:id]
    current_product = Product.find(params[:id])
    # creat new care item
    @cart_item = CartItem.create(cart_item_params)
    #get user cart
    current_cart  = Cart.where(user_id: user_id).first
    #check if exist
    if current_cart
      current_cart.items << current_product.id #@cart_item.id
    else
      current_cart= Cart.create(total_items: 1,user_id: user_id)
      current_cart.items << current_product.id
    end
    current_cart.errors.full_messages
    current_cart.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "carts" ("total_items", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["total_items", 1], ["created_at", "2019-04-24 11:40:29.673931"], ["updated_at", "2019-04-24 11:40:29.673931"], ["user_id", 9]]
INSERT INTO "cart_items" ("cart_id", "product_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 3], ["product_id", 9], ["amount", 1], ["created_at", "2019-04-24 11:41:19.702311"], ["updated_at", "2019-04-24 11:41:19.702311"]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 ORDER BY "carts"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "items" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["items", "{NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL}"], ["updated_at", "2019-04-24 11:33:58.103199"], ["id", 1]]

  def create
      product = Product.create(product_params)
---
INSERT INTO "products" ("name", "image", "created_at", "updated_at", "category_id", "quantity") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"