app/views/categories/show.html.erb


<p> the products is:  <% @category.products.each do |a| %>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 3]]